uhnp/src/Documents/РегистрацияОтчетаОЗаключенныхДоговорах/РегистрацияОтчетаОЗаключенныхДоговорах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияОтчетаОЗаключенныхДоговорах</name>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИнновационных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияЗаказчик</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаИнновационных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтчетностиОДоговорах</name>
    <type>
      <types>CatalogRef.ТипыОтчетностиОДоговорахЕИС</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ЕИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

uhnp/src/AccumulationRegisters/РасчетыСКонтрагентамиФакт/РасчетыСКонтрагентамиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКонтрагентамиФакт</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговораУХ</name>
    <type>
      <types>CatalogRef.ВидыДоговоровКонтрагентовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальныеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетовУХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСтруктурыЗадолженности</name>
    <type>
      <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/InformationRegisters/СтатистикаДоговоровДляЕИС/СтатистикаДоговоровДляЕИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаДоговоровДляЕИС</name>
  <resources>
    <name>КатегорияЗакупкиДляИсключенияИзГОЗ</name>
    <type>
      <types>CatalogRef.КатегорииЗакупокДляИсключенияИзГОЗ</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриРасчетеДолиЗакупокУСМП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеВключенВПланЗакупкиЧасть15Ст4ФЗ223</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПривлечениеМалогоИСреднегоПредпринимательстваКакПодрядчиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриоритетУчастияМалогоИСреднегоПредпринимательства</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПодписанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоговораВВалютеРеглУчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособВыбораПоставщика</name>
    <type>
      <types>EnumRef.СпособыВыбораПоставщика</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/РазмерыКонтрагентовДляЕИС/РазмерыКонтрагентовДляЕИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазмерыКонтрагентовДляЕИС</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Размер</name>
    <type>
      <types>EnumRef.РазмерыКонтрагентовДляЕИС</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)(-УХМодульМенеджера)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>ДевятьМесяцев</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыВыбораПоставщика/СпособыВыбораПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВыбораПоставщика</name>
  <enumValues>
    <name>ЗакупкаУЕдинственногоПоставщика</name>
  </enumValues>
  <enumValues>
    <name>Конкурс</name>
  </enumValues>
  <enumValues>
    <name>Аукцион</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКотировок</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПредложений</name>
  </enumValues>
  <enumValues>
    <name>КвалификационныйОтбор</name>
  </enumValues>
  <enumValues>
    <name>Редукцион</name>
  </enumValues>
  <enumValues>
    <name>КонкурентныеПереговоры</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКонкурсУМсп</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАукционУМсп</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросКотировокУМсп</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросПредложенийУМсп</name>
  </enumValues>
  <enumValues>
    <name>КонкурсУМсп</name>
  </enumValues>
  <enumValues>
    <name>АукционУМсп</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКотировокУМсп</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПредложенийУМсп</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/РазмерыКонтрагентовДляЕИС/РазмерыКонтрагентовДляЕИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазмерыКонтрагентовДляЕИС</name>
  <enumValues>
    <name>Микро</name>
  </enumValues>
  <enumValues>
    <name>Малый</name>
  </enumValues>
  <enumValues>
    <name>Средний</name>
  </enumValues>
  <enumValues>
    <name>Крупный</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/РегистрацияОтчетаОЗаключенныхДоговорах/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ОбработчикиСобытийДокумента


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ПроверитьСообщитьДокументНеУникальный(Отказ);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения = Неопределено Тогда
		ПериодРегистрации = ОбщегоНазначенияУХ.ОпределитьПериодПоДате(
			ТекущаяДатаСеанса(), Перечисления.Периодичность.Месяц);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	ЗаполнитьСуммыДокумента();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = Пользователи.ТекущийПользователь();
	УИД_ЕИС = "";
КонецПроцедуры


#КонецОбласти


#Область ПрограммныйИнтерфейс


Процедура ЗаполнитьСуммыДокумента() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Номер,
		|	ЕСТЬNULL(СУММА(РасчетыСКонтрагентамиФактОбороты.СуммаПриход), 0) КАК Сумма,
		|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасчетыСКонтрагентамиФактОбороты.ДоговорКонтрагента), 0) КАК Количество
		|ИЗ
		|	РегистрНакопления.РасчетыСКонтрагентамиФакт.Обороты(&ДатаНачала, &ДатаКонца, Период, Организация = &Организация) КАК РасчетыСКонтрагентамиФактОбороты
		|ГДЕ
		|	&КодТипаОтчета = 1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ЕСТЬNULL(СУММА(СтатистикаДоговоровДляЕИС.СуммаДоговораВВалютеРеглУчета), 0),
		|	ЕСТЬNULL(КОЛИЧЕСТВО(СтатистикаДоговоровДляЕИС.Договор), 0)
		|ИЗ
		|	РегистрСведений.СтатистикаДоговоровДляЕИС КАК СтатистикаДоговоровДляЕИС
		|ГДЕ
		|	СтатистикаДоговоровДляЕИС.Организация = &Организация
		|	И СтатистикаДоговоровДляЕИС.ДатаПодписанияДоговора МЕЖДУ &ДатаНачала И &ДатаКонца
		|	И СтатистикаДоговоровДляЕИС.СпособВыбораПоставщика = ЗНАЧЕНИЕ(Перечисление.СпособыВыбораПоставщика.ЗакупкаУЕдинственногоПоставщика)
		|	И НЕ СтатистикаДоговоровДляЕИС.НеВключенВПланЗакупкиЧасть15Ст4ФЗ223
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3,
		|	ЕСТЬNULL(СУММА(СтатистикаДоговоровДляЕИС.СуммаДоговораВВалютеРеглУчета), 0),
		|	ЕСТЬNULL(КОЛИЧЕСТВО(СтатистикаДоговоровДляЕИС.Договор), 0)
		|ИЗ
		|	РегистрСведений.СтатистикаДоговоровДляЕИС КАК СтатистикаДоговоровДляЕИС
		|ГДЕ
		|	СтатистикаДоговоровДляЕИС.Организация = &Организация
		|	И СтатистикаДоговоровДляЕИС.ДатаПодписанияДоговора МЕЖДУ &ДатаНачала И &ДатаКонца
		|	И НЕ СтатистикаДоговоровДляЕИС.НеВключенВПланЗакупкиЧасть15Ст4ФЗ223
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	4,
		|	ЕСТЬNULL(СУММА(СтатистикаДоговоровДляЕИС.СуммаДоговораВВалютеРеглУчета), 0),
		|	ЕСТЬNULL(КОЛИЧЕСТВО(СтатистикаДоговоровДляЕИС.Договор), 0)
		|ИЗ
		|	РегистрСведений.СтатистикаДоговоровДляЕИС КАК СтатистикаДоговоровДляЕИС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыКонтрагентовДляЕИС.СрезПоследних(&ДатаКонца, Размер <> ЗНАЧЕНИЕ(Перечисление.РазмерыКонтрагентовДляЕИС.Крупный)) КАК РазмерыКонтрагентовДляЕИССрезПоследних
		|		ПО (СтатистикаДоговоровДляЕИС.Организация = &Организация)
		|			И (РазмерыКонтрагентовДляЕИССрезПоследних.Контрагент = СтатистикаДоговоровДляЕИС.Договор.Контрагент)
		|			И (СтатистикаДоговоровДляЕИС.ДатаПодписанияДоговора МЕЖДУ &ДатаНачала И &ДатаКонца)
		|ГДЕ
		|	&КодТипаОтчета = 4";
	Запрос.УстановитьПараметр("ДатаНачала", ПериодРегистрации.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", ПериодРегистрации.ДатаОкончания);
	Запрос.УстановитьПараметр("КодТипаОтчета", ТипОтчетностиОДоговорах.Код);
	Запрос.УстановитьПараметр("Организация", ОрганизацияЗаказчик);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сумма = ВыборкаДетальныеЗаписи.Сумма;
		Количество = ВыборкаДетальныеЗаписи.Количество;
	Иначе
		Сумма = 0;
		Количество = 0;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти


#Область ВнутреннийПрограммныйИнтерфейс


Процедура ПроверитьСообщитьДокументНеУникальный(Отказ)
	мДокументов = ЦентрализованныеЗакупкиУХ.ПолучитьДокументыПоОтбору(
		"РегистрацияОтчетаОЗаключенныхДоговорах",
		Новый Структура(
			"ОрганизацияЗаказчик, ПериодРегистрации, ТипОтчетностиОДоговорах, Проведен",
			 ОрганизацияЗаказчик, ПериодРегистрации, ТипОтчетностиОДоговорах, Истина),
		Ссылка);
	Если мДокументов.Количество() > 0 Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке(
			СтрШаблон(НСтр(
				"ru='Для организации ""%1"" на период ""%2"" уже зарегистрирован отчет"
				 + " о заключенных договорах с типом ""%3"" документом ""%4!""'"),
		 		ОрганизацияЗаказчик,
				ПериодРегистрации,
				ТипОтчетностиОДоговорах,
				мДокументов[0]),
			Отказ,
			,
			СтатусСообщения.Важное);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти


#КонецЕсли
